"""
1. Напишите программу на Python для создания лямбда-функции, которая прибавляет 15 к заданному числу, переданному в качестве аргумента, а также для создания лямбда-функции, которая умножает аргумент x на аргумент y и печатает результат.
Пример вывода:
25
48


2. Напишите программу на Python для создания функции, которая принимает один аргумент, и этот аргумент будет умножен на неизвестное заданное число.
Пример вывода:
Удвоить число 15 = 30
Утроить число 15 = 45
Четырехкратное число 15 = 60
Удвоить число 15 = 75


3. Напишите программу на Python для сортировки списка кортежей с помощью лямбд.
Исходный список кортежей:
[('English', 88), ('Science', 90), ('Maths', 97), ('Social sciences', 82)].
Сортировка списка кортежей:
[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]


4. Напишите программу на языке Python для сортировки списка словарей с помощью лямбд.
Исходный список словарей :
[{'марка': 'Nokia', 'модель': 216, 'цвет': 'черный'}, {'марка': 'Mi Max', 'модель': '2', 'цвет': 'золотой'}, {'марка': 'Samsung', 'модель': 7, 'цвет': 'blue'}]
Сортировка списка словарей :
[{'марка': 'Nokia', 'модель': 216, 'цвет': 'черный'}, {'марка': 'Samsung', 'модель': 7, 'цвет': 'blue'}, {'марка': 'Mi Max', 'модель': '2', 'цвет': 'золотой'}]


5. Напишите программу на Python для фильтрации списка целых чисел с помощью лямбды.
Исходный список целых чисел:
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Четные числа из указанного списка:
[2, 4, 6, 8, 10]
Нечетные числа из указанного списка:
[1, 3, 5, 7, 9]


6. Напишите программу на Python, которая с помощью лямбд возводит в квадрат и куб каждое число из заданного списка целых чисел.
Исходный список целых чисел:
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Возведите в квадрат каждое число из указанного списка:
[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
Возведите в куб каждое число из указанного списка:
[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]


7. Напишите программу на языке Python, чтобы найти, начинается ли заданная строка с заданного символа, используя лямбду.
Пример вывода:
True
False


8. Напишите программу на Python для извлечения года, месяца, даты и времени с помощью Lambda.
Пример вывода:
2020-01-15 09:03:32.744178
2020
1
15
09:03:32.744178


9. Напишите программу на Python для проверки того, является ли заданная строка числом или нет, используя лямбду.
Пример вывода:
True
True
False
True
Ложь
True
Печать контрольных чисел:
True
True


10. Напишите программу на языке Python для создания ряда Фибоначчи до n с помощью лямбды.
Ряд Фибоначчи до 2:
[0, 1]
Ряд Фибоначчи до 5:
[0, 1, 1, 2, 3]
Ряд Фибоначчи до 6:
[0, 1, 1, 2, 3, 5]
Ряд Фибоначчи до 9:
[0, 1, 1, 2, 3, 5, 8, 13, 21]


11. Напишите программу на Python для нахождения пересечения двух заданных массивов с помощью Lambda.
Исходные массивы:
[1, 2, 3, 5, 7, 8, 9, 10]
[1, 2, 4, 8, 9]
Пересечение указанных массивов: [1, 2, 8, 9]


12. Напишите программу на Python для перестановки положительных и отрицательных чисел в заданном массиве с помощью лямбды.
Исходные массивы:
[-1, 2, -3, 5, 7, 8, 9, -10]
Перестановка положительных и отрицательных чисел в указанном массиве:
[2, 5, 7, 8, 9, -10, -3, -1]


13. Напишите программу на Python для подсчета четных и нечетных чисел в заданном массиве целых чисел с использованием лямбды.
Исходные массивы:
[1, 2, 3, 5, 7, 8, 9, 10]
Количество четных чисел в указанном массиве: 3
Количество нечетных чисел в указанном массиве: 5


14. Напишите программу на Python для фильтрации заданного списка, чтобы определить, имеют ли значения в списке длину 6, используя Lambda.
Пример вывода:
Monday
Friday
Sunday


15. Напишите программу на Python для сложения двух заданных списков с использованием map и lambda.
Исходный список:
[1, 2, 3]
[4, 5, 6]
Результат: после сложения двух списков
[5, 7, 9]


16. Напишите программу на Python, чтобы найти вторую наименьшую суммарную оценку любого ученика (учеников) из заданных имен и оценок каждого ученика, используя списки и лямбды. Введите количество студентов, имена и оценки каждого студента.
Введите количество студентов: 5
Имя: S ROY
Класс: 1
Имя: B BOSE
Оценка: 3
Имя: N KAR
Класс: 2
Имя: C DUTTA
Класс: 1
Имя: G GHOSH
Класс: 1
Имена и оценки всех учеников:
[['S ROY', 1.0], ['B BOSE', 3.0], ['N KAR', 2.0], ['C DUTTA', 1.0], ['G GHOSH', 1.0]].
Вторая низкая оценка: 2.0
Имена:
N KAR


17. Напишите программу на языке Python для нахождения чисел, кратных девятнадцати или тринадцати, из списка чисел с помощью Lambda.
Исходный список:
[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]
Числа из приведенного выше списка, кратные девятнадцати или тринадцати:
[19, 65, 57, 39, 152, 190]


18. Напишите программу на языке Python для поиска палиндромов в заданном списке строк с помощью лямбд.
Исходный список строк:
['php', 'w3r', 'Python', 'abcd', 'Java', 'aaa'].
Список палиндромов:
['php', 'aaa'].


19. Напишите программу на языке Python для поиска всех анаграмм строки в заданном списке строк с помощью лямбды.
Исходный список строк:
['bcda', 'abce', 'cbda', 'cbea', 'adcb'].
Анаграммы 'abcd' в приведенной выше строке:
['bcda', 'cbda', 'adcb'].


20. Напишите программу на Python, которая будет находить числа в заданной строке и сохранять их в списке. После этого выведите на экран числа, длина которых больше длины списка, в отсортированном виде. Для решения задачи используйте функцию лямбда.
Исходная строка: sdf 23 safs8 5 sdfsd8 sdfs 56 21sfs 20 5
Числа в отсортированном виде:
20 23 56


21. Напишите программу на Python, которая умножает каждое число в списке на заданное число, используя лямбда-функции. Выведите результаты.
Исходный список: [2, 4, 6, 9, 11]
Заданное число: 2
Результат:
4 8 12 18 22


22. Напишите программу на Python, которая вычисляет длину списка имен после удаления тех, которые начинаются со строчных букв. Используйте функцию лямбда.
Результат:
16


23. Напишите программу на Python для вычисления суммы положительных и отрицательных чисел заданного списка чисел с помощью функции лямбда.
Исходный список: [2, 4, -6, -9, 11, -12, 14, -5, 17]
Сумма положительных чисел: -32
Сумма отрицательных чисел: 48


24. Напишите программу на Python для поиска чисел в заданном диапазоне, где каждое число делится на все содержащиеся в нем цифры.
Пример вывода:
[1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 15, 22]


25. Напишите программу на Python для создания следующего большего числа путем перестановки цифр заданного числа.
Исходное число: 12
Следующее большее число: 21
Исходное число: 10
Следующее большее число: False
Исходное число: 201
Следующее большее число: 210
Исходное число: 102
Следующее большее число: 120
Оригинальное число: 445
Следующее большее число: 454


26. Напишите программу на Python для поиска списка с максимальной и минимальной длиной с помощью лямбд.
Исходный список:
[[0], [1, 3], [5, 7], [9, 11], [13, 15, 17]]
Список с максимальной длиной списков:
(3, [13, 15, 17])
Список с минимальной длиной списков:
(1, [0])


27. Напишите программу на Python для сортировки каждого подсписка строк в заданном списке списков с помощью лямбд.
Исходный список:
[['green', 'оранжевый'], ['черный', 'white'], ['white', 'черный', 'оранжевый']].
После сортировки каждого подсписка указанного списка списков:
[['green', 'оранжевый'], ['черный', 'white'], ['черный', 'оранжевый', 'white']].


28. Напишите программу на языке Python для сортировки заданного списка списков по длине и значению с использованием лямбд.
Исходный список:
[[2], [0], [1, 3], [0, 7], [9, 11], [13, 15, 17]]
Отсортируйте список по длине и значению:
[[0], [2], [0, 7], [1, 3], [9, 11], [13, 15, 17]]


29. Напишите программу на Python для нахождения максимального значения в заданном неоднородном списке с помощью лямбд.
Исходный список:
['Python', 3, 2, 4, 5, 'version'].
Максимальные значения в указанном списке с помощью лямбды:
5


30. Напишите программу на Python для сортировки заданной матрицы в порядке возрастания по сумме строк с помощью лямбды.
Исходная матрица:
[[1, 2, 3], [2, 4, 5], [1, 1, 1]]
Отсортируйте указанную матрицу в порядке возрастания по сумме ее строк
[[1, 1, 1], [1, 2, 3], [2, 4, 5]]
Исходная матрица:
[[1, 2, 3], [-2, 4, -5], [1, -1, 1]]
Отсортируйте указанную матрицу в порядке возрастания по сумме ее строк
[[-2, 4, -5], [1, -1, 1], [1, 2, 3]]


31. Напишите программу на языке Python для извлечения заданного количества строк из заданного списка строковых значений с помощью лямбд.
Исходный список:
['Python', 'список', 'упражнения', 'практика', 'решение'].
длина строки для извлечения:
8
После извлечения строк заданной длины из указанного списка:
['practice', 'solution'].


32. Напишите программу на Python для подсчета плавающих значений в смешанном списке с помощью лямбд.
Исходный список:
[1, 'abcd', 3.12, 1.2, 4, 'xyz', 5, 'pqr', 7, -5, -12.22].
Количество плавающих элементов в указанном смешанном списке:
3


33. Напишите программу на языке Python для проверки того, содержит ли заданная строка заглавную и строчную буквы, число и минимальную длину, используя лямбды.
Введите строку: W3resource
['Valid string.'].


34. Напишите программу на Python для фильтрации высоты и ширины студентов, которые хранятся в словаре, используя лямбду.
Оригинальный словарь:
{'Cierra Vega': (6.2, 70), 'Alden Cantrell': (5.9, 65), 'Kierra Gentry': (6.0, 68), 'Pierre Cox': (5.8, 66)}.
Рост> 6 футов и вес> 70 кг:
{'Cierra Vega': (6.2, 70)}.


35. Напишите программу на Python для проверки сортировки заданного списка с помощью лямбд.
Исходный список:
[1, 2, 4, 6, 8, 10, 12, 14, 16, 17]
Отсортирован ли указанный список!
True
Исходный список:
[1, 2, 4, 6, 8, 10, 12, 14, 16, 17]
Указанный список отсортирован!
Ложь


36. Напишите программу на языке Python для извлечения n-го элемента из заданного списка кортежей с помощью лямбд.
Исходный список:
[('Грейсон Фултон', 98, 99), ('Брейди Кент', 97, 96), ('Уайатт Нотт', 91, 94), ('Бо Тернбулл', 94, 98)].
Извлеките n-й элемент ( n = 0 ) из указанного списка кортежей:
['Грейсон Фултон', 'Брейди Кент', 'Уайатт Нотт', 'Бо Тернбулл'].
Извлеките n-й элемент ( n = 2 ) из указанного списка кортежей:
[99, 96, 94, 98]


37. Напишите программу на Python для сортировки списка списков по заданному индексу внутреннего списка с помощью лямбд.
Исходный список:
[('Greyson Fulton', 98, 99), ('Brady Kent', 97, 96), ('Wyatt Knott', 91, 94), ('Beau Turnbull', 94, 98)]

Отсортируйте указанный список списков по заданному индексу (Index = 0) внутреннего списка
[('Beau Turnbull', 94, 98), ('Brady Kent', 97, 96), ('Greyson Fulton', 98, 99), ('Wyatt Knott', 91, 94)]

Отсортируйте указанный список списков по заданному индексу (Index = 2) внутреннего списка
[('Wyatt Knott', 91, 94), ('Brady Kent', 97, 96), ('Beau Turnbull', 94, 98), ('Greyson Fulton', 98, 99)]


38. Напишите программу на языке Python для удаления всех элементов из заданного списка, присутствующих в другом списке, с помощью лямбд.
Исходные списки:
list1: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list2: [2, 4, 6, 8]
Удалить все элементы из 'list1', присутствующие в 'list2':
[1, 3, 5, 7, 9, 10]


39. Напишите программу на Python для поиска элементов заданного списка строк, содержащих определенную подстроку, используя лямбды.
Исходный список:
['red', 'black', 'white', 'green', 'orange'].
Подстрока для поиска:
ack
Элементы указанного списка, содержащие определенную подстроку:
['black'].
Подстрока для поиска:
abc
Элементы указанного списка, содержащие определенную подстроку:
[]


40. Напишите программу на языке Python для поиска элементов вложенного списка, которые присутствуют в другом списке, используя лямбды.
Исходные списки: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
[[12, 18, 23, 25, 45], [7, 11, 19, 24, 28], [1, 5, 8, 18, 15, 16]]
Пересечение указанных вложенных списков:
[[12], [7, 11], [1, 5, 8]]


41. Напишите программу на языке Python для реверсирования строк в заданном списке строковых значений с помощью лямбд.
Исходные списки:
['Red', 'Green', 'Blue', 'White', 'Black'].
Обратные строки заданного списка:
['deR', 'neerG', 'eulB', 'etihW', 'kcalB'].


42. Напишите программу на языке Python для вычисления произведения заданного списка чисел с помощью лямбд.
list1: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Произведение указанных чисел списка:
3628800
list2: [2.2, 4.12, 6.6, 8.1, 8.3]
Произведение указанных чисел списка:
4021.8599520000007


43. Напишите программу на Python для умножения всех чисел в заданном списке с помощью лямбд.
Исходный список:
[4, 3, 2, 2, -1, 18]
Перемножить все числа указанного списка: -864
Исходный список:
[2, 4, 8, 8, 3, 2, 9]
Умножьте все числа указанного списка: 27648


44. Напишите программу на языке Python для вычисления среднего значения чисел в заданном кортеже с помощью лямбд.
Исходный кортеж:
((10, 10, 10), (30, 45, 56), (81, 80, 39), (1, 2, 3))
Среднее значение чисел указанного кортежа кортежей:
(30.5, 34.25, 27.0)
Исходный кортеж:
((1, 1, -5), (30, -15, 56), (81, -60, -39), (-10, 2, 3))
Среднее значение чисел указанного кортежа кортежей:
(25.5, -18.0, 3.75)


45. Напишите программу на языке Python для преобразования элементов строки в целые числа внутри заданного кортежа с помощью лямбд.
Исходные значения кортежа:
(('233', 'ABCD', '33'), ('1416', 'EFGH', '55'), ('2345', 'WERT', '34'))
Новые значения кортежей:
((233, 33), (1416, 55), (2345, 34))


46. Напишите программу на Python, чтобы найти позицию индекса и значение максимального и минимального значений в заданном списке чисел с помощью лямбд.
Исходный список:
[12, 33, 23, 10.11, 67, 89, 45, 66.7, 23, 12, 11, 10.25, 54]
Позиция индекса и значение максимального значения указанного списка:
(5, 89)
Позиция индекса и значение минимального значения указанного списка:
(3, 10.11)


47. Напишите программу на языке Python для сортировки заданного смешанного списка целых чисел и строк с помощью лямбд. Числа должны быть отсортированы раньше строк.
Исходный список:
[19, 'red', 12, 'green', 'blue', 10, 'white', 'green', 1].
Отсортируйте указанный смешанный список целых чисел и строк:
[1, 10, 12, 19, 'blue', 'green', 'green', 'red', 'white'].


48. Напишите программу на языке Python для численной сортировки заданного списка строк (чисел) с помощью лямбд.
Исходный список:
['4', '12', '45', '7', '0', '100', '200', '-12', '-500']
Отсортируйте указанный список строк (чисел) по порядку:
['-500', '-12', '0', '4', '7', '12', '45', '100', '200']


49. Напишите программу на Python для подсчета количества элементов в заданном списке с помощью лямбд.
Исходный список:
[3, 4, 5, 8, 0, 3, 8, 5, 0, 3, 1, 5, 2, 3, 4, 2]
Подсчитайте количество вхождений элементов в указанном списке:
{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}


50. Напишите программу на языке Python для удаления определенных слов из заданного списка с помощью лямбд.
Исходный список:
['orange', 'red', 'green', 'blue', 'white', 'black'].
Удалить слова:
['orange', 'black'].
После удаления указанных слов из указанного списка:
['red', 'green', 'blue', 'white'].


51. Напишите программу на языке Python для нахождения максимального и минимального значений в заданном списке кортежей с помощью лямбда-функции.
Исходный список с кортежами:
[('V', 62), ('VI', 68), ('VII', 72), ('VIII', 70), ('IX', 74), ('X', 65)].
Максимальное и минимальное значения указанного списка кортежей:
(74, 62)


52. Напишите программу на языке Python для удаления значений None из заданного списка с помощью функции лямбда.
Исходный список:
[12, 0, None, 23, None, -55, 234, 89, None, 0, 6, -12].
Удалите значение None из указанного списка:
[12, 0, 23, -55, 234, 89, 0, 6, -12]

"""
