"""
Задание 1
Пользователь вводит числа a и b. Создать список, содержащий квадраты целых чисел расположенных между ними.

Задание 2
Пользователь вводит числа до тех пор, пока не введет слово 'No'. Поместите введенные числа в список. Выведите на экран
только нечетные элементы списка.

Задание 3
Пользователь вводит числа до тех пор, пока не введет слово ‘No’. Поместите введенные числа в список. Подсчитайте
количество четных и нечетных элементов в списке.

Задание 4
Дан список чисел. Выведите все элементы списка, которые больше предыдущего элемента.

Задание 5
Дан список чисел. Поменяйте местами минимальный и максимальный элемент этого списка.

Задание 6
Дан список чисел. Определите, сколько в нем различных элементов.

Задание 7
Дан список чисел. Циклически сдвиньте элементы списка вправо (A[0] переходит на место A[1], A[1] на место A[2], …,
 последний элемент переходит на место A[0]).
"""
