"""
Красный, синий и желтый называются основными цветами, потому что их нельзя получить путем смешения
других цветов. При смешивании двух основных цветов получается вторичный цвет:
• если смешать красный и синий, то получится фиолетовый;
• если смешать красный и желтый, то получится оранжевый;
• если смешать синий и желтый, то получится зеленый.
Разработайте программу, которая предлагает пользователю ввести названия двух основных цветов для смешивания. Если
пользователь вводит что-нибудь помимо названий "красный", "синий" или "желтый", то программа должна вывести сообщение
об ошибке. В противном случае программа должна вывести название вторичного цвета, который получится в результате.
"""
