"""
Напишите программу, которая выводит индекс и код символа во введенной пользователем строке.
"""

word = 'python'
print('0', ord(word[0]))
