"""
Вам дана строка.
Ваша задача - выяснить, содержит ли строка: буквенно-цифровые символы, алфавитные символы, цифры, строчные и
прописные символы.
Формат ввода
Одна строка, содержащая строку.
Ограничения

Формат вывода
В первой строке выведите True, если в ней есть алфавитно-цифровые символы. В противном случае выведите False.
Во второй строке выведите True, если в ней есть алфавитно-цифровые символы. В противном случае выведите False.
В третьей строке выведите True, если есть цифры. В противном случае выведите False.
В четвертой строке выведите True, если в ней есть строчные символы. В противном случае выведите False.
В пятой строке выведите True, если есть прописные символы. В противном случае выведите False.
"""
