"""
Напишите программу, которая получает три строки: фамилию, имя и отчество человека, а потом выводит на экран
инициалы и фамилию.
"""

first_name = 'Erich'
middle_name = 'Maria'
last_name = 'Remark'

# E.M. Remark
# first_name_initial = first_name[0] + '. '
# middle_name_initial = middle_name[0] + '. '

# print(first_name_initial + middle_name_initial + last_name)

print(f'{first_name[0]}. {middle_name[0]}. {last_name}')
