# Лекция 4: Некоторые build-in методы. List comprehension Работа с файлами




# Работа с Файлами в Python: Чтение и Запись

Работа с файлами - важная часть программирования в Python. В этой статье мы рассмотрим основные операции чтения и записи
файлов, а также различные способы работы с текстовыми и бинарными файлами в Python.

## Открытие и Закрытие Файла

Прежде чем начать работать с файлом, необходимо его открыть с помощью функции `open()`. Эта функция принимает два
аргумента: имя файла и режим доступа (чтение, запись и т. д.). Например, чтобы открыть файл для чтения, используйте
следующий код:

```python
file = open("example.txt", "r")
```

После завершения работы с файлом, его следует закрыть с помощью метода `close()`:

```python
file.close()
```

Закрытие файла важно, чтобы освободить ресурсы и обеспечить целостность данных.

## Чтение из Файла

### Чтение всего файла

Для чтения всего содержимого файла можно использовать метод `read()`:

```python
file = open("example.txt", "r")
content = file.read()
file.close()
```

### Чтение по строкам

Чтение файла по строкам можно выполнить с помощью итерации:

```python
file = open("example.txt", "r")
for line in file:
    print(line)
file.close()
```

### Чтение определенного количества символов

Можно прочитать определенное количество символов из файла с помощью метода `read()` с аргументом:

```python
file = open("example.txt", "r")
partial_content = file.read(50)  # Прочитать первые 50 символов файла
file.close()
```

## Запись в Файл

### Запись текста в файл

Для записи текста в файл используйте режим доступа "w" (запись) с функцией `write()`:

```python
file = open("example.txt", "w")
file.write("Привет, мир!")
file.close()
```

Если файл не существует, он будет создан. Если файл существует, его содержимое будет заменено.

### Добавление текста в файл

Чтобы добавить текст к существующему файлу, используйте режим доступа "a" (добавление):

```python
file = open("example.txt", "a")
file.write("\nДополнительная строка")
file.close()
```

## Автоматическое Закрытие Файла (Контекстный менеджер)

Python предоставляет удобный способ автоматического закрытия файла после завершения работы с ним, используя контекстный
менеджер (`with`):

```python
with open("example.txt", "r") as file:
    content = file.read()
# Файл автоматически закроется после завершения блока with
```

## Работа с Бинарными Файлами

Все вышеупомянутые операции могут быть выполнены как с текстовыми, так и с бинарными файлами. Для работы с бинарными
файлами используются режимы доступа "rb" (чтение бинарного файла) и "wb" (запись бинарного файла).

```python
# Чтение бинарного файла
with open("binary_file.bin", "rb") as file:
    binary_data = file.read()

# Запись бинарного файла
with open("binary_file.bin", "wb") as file:
    binary_data = b'\x00\x01\x02\x03\x04'
    file.write(binary_data)
```

Практика:

1. **Чтение файла и вывод его содержимого**: Cоздайте текстовый файл `sample.txt` с несколькими строками текста.
   Написать программу, которая открывает файл и выводит его содержимое на экран.

2. **Запись в файл**: Написать программу, которая запрашивает у пользователя несколько строк текста
   и записывает их в файл с именем `output.txt`.

3. **Копирование файла**: Создайте два текстовых файла `source.txt` и `destination.txt`. Написать
   программу, которая читает содержимое `source.txt` и записывает его в `destination.txt`.

4. **Анализ файла**: Создайте текстовый файл со списком чисел. Написать программу, которая читает файл, и печатает самое
   большое число из файла.

5. **Конвертация файлов**: Создайте текстовый файл с температурами в градусах Цельсия. Написать программу, которая
   читает файл, конвертирует температуры в градусы Фаренгейта и записывает
   результаты в новый файл.

6. **Подсчет слов в файле**: Написать программу, которая считает количество слов в текстовом файле.
