**Во всех задачах считывайте входные данные через input() и выводите ответ через print().**

# Задание 1
Условие

Получите строку от пользователя.

Задача

Сначала выведите третий символ этой строки.

Во второй строке выведите предпоследний символ этой строки.

В третьей строке выведите первые пять символов этой строки.

В четвертой строке выведите всю строку, кроме последних двух символов.

В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).

В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.

В седьмой строке выведите все символы в обратном порядке.

В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.

В девятой строке выведите длину данной строки.


# Задание 2

Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи 
метод `count`.

# Задание 3

Дана строка. Разрежьте ее на две равные части (если длина строки — четная, а если длина строки нечетная, то длина 
первой части должна быть на один символ больше). Переставьте эти две части местами, результат запишите в новую строку 
и выведите на экран.

При решении этой задачи не стоит пользоваться инструкцией if.

# Задание 4

Дана строка, состоящая ровно из двух слов, разделенных пробелом. Переставьте эти слова местами. Результат запишите в 
строку и выведите получившуюся строку.

При решении этой задачи не стоит пользоваться циклами и инструкцией if.

# Задание 5

Дана строка, в которой буква h встречается минимум два раза. Удалите из этой строки первое и последнее вхождение 
буквы h, а также все символы, находящиеся между ними.

# Задание 6

Дана строка. Замените в этой строке все цифры 1 на слово one.

# Задание 7

Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.

# Задание 8

Создайте функцию, которая выдает персональное приветствие. Эта функция принимает два параметра: имя и владелец.
Используйте условные обозначения, чтобы вернуть нужное сообщение:

```python
def greet(name, owner):
    pass

assert greet('Daniel', 'Daniel') == 'Hello boss'
assert greet('Greg', 'Daniel') == 'Hello guest'
```

# Задание 9

Вам нужно написать функцию, которая меняет местами слова в заданной строке.
Слово также может быть пустой строкой. Если это недостаточно понятно, приведите несколько примеров:

```text
"Hello World" --> Hello World
"Hi There." --> "Hi There."
```
```python
def replase_worlds(string):
    pass

assert replase_worlds("Hello World") == "World Hello"
assert replase_worlds("Hi There.") == "There. Hi"
assert replase_worlds("") == ""
```

# Задание 10

Напишите проверку на то, является ли строка палиндромом. Палиндром — это слово или фраза, которые одинаково читаются 
слева направо и справа налево.
Подсказка. Используйте срезы.
