"""
Допустим, что сосиски упакованы в пакеты по 10 штук, а булочки — в пакеты по 8 штук. Напишите программу, которая
вычисляет количество упаковок с сосисками и количество упаковок с булочками, необходимых для пикника с минимальными
остатками. Программа должна запросить у пользователя количество участников пикника и количество хот-догов,
которые будут предложены каждому участнику. Программа должна показать приведенные ниже подробности:
• минимально необходимое количество упаковок с сосисками;
• минимально необходимое количество упаковок с булочками;
• количество оставшихся сосисок;
• количество оставшихся булочек.
"""
