"""
1. Напишите функцию Python, которая отфильтровывает четные числа из списка целых чисел с помощью функции filter.


2. Напишите программу на Python, которая с помощью функции filter извлекает все заглавные буквы из списка строк со смешанным регистром.


3. Напишите функцию Python, которая с помощью функции фильтрации отфильтровывает из списка чисел все элементы, меньшие или равные заданному значению.


4. Напишите программу на Python, которая создает список имен и с помощью функции фильтрации извлекает имена, начинающиеся с гласной буквы (A, E, I, O, U).


5. Напишите функцию Python, которая отфильтровывает все пустые строки из списка строк с помощью функции фильтрации.


6. Напишите программу на Python, которая создает список словарей, содержащих информацию о студентах (имя, возраст, оценка), и с помощью функции фильтрации извлекает студентов с оценкой больше или равной 95.


7. Напишите программу на Python, которая отфильтровывает простые числа из списка целых чисел с помощью функции filter.


8. Напишите программу на Python, которая создает список слов и с помощью функции фильтрации извлекает слова, содержащие более пяти букв.


9. Напишите функцию Python, которая отфильтровывает элементы из списка строк, содержащих определенную подстроку, с помощью функции фильтрации.


10. Напишите программу на языке Python, которая отфильтровывает даты (в формате "YYYY-MM-DD"), находящиеся в будущем, с помощью функции фильтрации.


11. Напишите программу на Python, которая создает список кортежей, каждый из которых содержит название города и его население. Используйте функцию фильтрации для извлечения городов с населением более 2 миллионов человек.
"""