"""
Задание 1
Пользователь вводит числа a и b. Создать список, содержащий квадраты целых чисел расположенных между ними.

Задание 2
Пользователь вводит числа до тех пор, пока не введет слово 'No'. Поместите введенные числа в список. Выведите на экран
только нечетные элементы списка.

Задание 3
Пользователь вводит числа до тех пор, пока не введет слово ‘No’. Поместите введенные числа в список. Подсчитайте
количество четных и нечетных элементов в списке.

Задание 4
Дан список чисел. Выведите все элементы списка, которые больше предыдущего элемента.

Задание 5
Дан список чисел. Поменяйте местами минимальный и максимальный элемент этого списка.

Задание 6
Дан список чисел. Определите, сколько в нем различных элементов.

Задание 7
Дан список чисел. Циклически сдвиньте элементы списка вправо (A[0] переходит на место A[1], A[1] на место A[2], …,
последний элемент переходит на место A[0]).

Задание 8
Общий объем продаж. Разработайте программу, которая просит пользователя ввести продажи магазина за каждый день недели.
Суммы должны быть сохранены в списке. Примените цикл, чтобы вычислить общий объем продаж за неделю и показать результат.

Задание 9
Генератор лотерейных чисел. Разработайте программу, которая генерирует семизначную комбинацию лотерейных чисел.
Программа должна сгенерировать семь случайных чисел, каждое в диапазоне от 0 до 9, и присвоить каждое число элементу
списка.

Задание 10
В программе напишите функцию, которая принимает два аргумента: список и число п. Допустим, что список содержит числа.
Функция должна показать все числа в списке, которые больше п.

Задание 11
Генерация простого числа. Натуральное (целое положительное) число является простым, если оно не имеет делителей кроме 1
и самого себя. Натуральное (целое положительное) число является составным, если оно не является простым. Напишите
программу, которая просит пользователя ввести целое число больше 1 и затем выводит все простые числа, которые меньше
или равны введенному числу. Программа должна работать следующим образом:
• после того как пользователь ввел число, программа должна заполнить список всеми целыми числами начиная с 2 и до
введенного значения;
• затем программа должна применить цикл, чтобы пройти по списку. Каждый элемент должен быть в цикле передан в функцию,
которая определяет и сообщает, что элемент является простым числом или составным числом.

Задание 12
Бег на беговой дорожке позволяет сжигать 4,2 калорий в минуту. Напишите программу, которая применяет цикл для вывода
количества калорий, сожженных после 10, 15, 20, 25 и 30 минут бега.

Задание 13
Таблица соответствия между градусами Цельсия и градусами Фаренгейта. Напишите программу, которая выводит таблицу
температур по шкале Цельсия от 0 до 20 и их эквиваленты по Фаренгейту. Формула преобразования температуры из шкалы
Цельсия в шкалу Фаренгейта:

F= 9/5 * C + 32
где F — это температура по шкале Фаренгейта; С — температура по шкале Цельсия. Для вывода этой таблицы ваша программа
должна применить цикл.

Задание 14
В некотором университете обучение студента-очника составляет 145 000 рублей в семестр. Было объявлено, что плата за
обучение будет повышаться на 3% каждый год в течение следующих 5 лет. Напишите программу с циклом, который выводит
плановую сумму за обучение в год (за курс) в течение следующих 5 лет.

Задание 15
Напишите программу, которая применяет вложенные циклы для рисования этого узора:
*******
******
*****
****
***
**
*

Задание 16
Напишите программу, которая получает список слов и выводит каждое слово задом наперед, при этом слова идут в исходном
порядке. Методами reverse() и циклом пользоваться нельзя.

"""
