"""
1. Напишите программу на Python, которая утроит все числа в заданном списке целых чисел. Используйте карту Python.

2. Напишите программу на Python для сложения трех заданных списков, используя Python map и лямбды.

3. Напишите программу на Python, чтобы перечислить список заданных строк по отдельности с помощью Python map.

4. Напишите программу на Python для создания списка, содержащего мощность указанного числа в базисе, возведенную в степень соответствующего числа в индексе, используя Python map.

5. Напишите программу на Python для возведения элементов списка в квадрат с помощью функции map().

6. Напишите программу на Python для преобразования всех символов в прописные и строчные и удаления дублирующихся букв из заданной последовательности. Используйте функцию map().

7. Напишите программу на Python, чтобы сложить два заданных списка и найти разницу между ними. Используйте функцию map().

8. Напишите программу на Python для преобразования заданного списка целых чисел и кортежа целых чисел в список строк.

9. Напишите программу на Python для создания нового списка из определенных элементов кортежа и преобразования строкового значения в целое число.

10. Напишите программу на Python для вычисления квадрата первых N чисел Фибоначчи с помощью функции map и создания списка этих чисел.
"""
