"""
1. Чтение файла и вывод его содержимого**: создайте текстовый файл `sample.txt` с несколькими строками текста.
   Написать программу, которая открывает файл и выводит его содержимое на экран.

2. Запись в файл: написать программу, которая запрашивает у пользователя несколько строк текста
   и записывает их в файл с именем `output.txt`.

3. Копирование файла: создайте два текстовых файла `source.txt` и `destination.txt`. Написать
   программу, которая читает содержимое `source.txt` и записывает его в `destination.txt`.

4. Анализ файла: создайте текстовый файл со списком чисел. Написать программу, которая читает файл, и печатает самое
   большое число из файла.

5. Конвертация файлов: создайте текстовый файл с температурами в градусах Цельсия. Написать программу, которая
   читает файл, конвертирует температуры в градусы Фаренгейта и записывает
   результаты в новый файл.

6. Подсчет слов в файле: написать программу, которая считает количество слов в текстовом файле.
"""